Factorización de diagramas parte 1
